Revit 2027 API
GraphicsStyle.GraphicsStyleType Property
The graphics style type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public GraphicsStyleType GraphicsStyleType { get; }
Public ReadOnly Property GraphicsStyleType As GraphicsStyleType
	Get
public:
property GraphicsStyleType GraphicsStyleType {
	GraphicsStyleType get ();
}
member GraphicsStyleType : GraphicsStyleType with get
Property Value
GraphicsStyleType
See Also
Reference
GraphicsStyle Class
Autodesk.Revit.DB Namespace